rpi5-1/20240119-1702-glibc/3-locks-mempool/1000/pgbench-warmup-1-10.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 1
partition method: range
partitions: 10
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 1471476
number of failed transactions: 0 (0.000%)
latency average = 1.304 ms
initial connection time = 50.028 ms
tps = 24539.823279 (without initial connection time)